In [53]:
from selenium import webdriver
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys
import time
import pandas as pd

In [ ]:
# QUESTION - 1

In [ ]:
# scraping jobs from naukri.com

In [55]:
driver = webdriver.Chrome()

In [57]:
driver.get("https://www.naukri.com/")

In [59]:
designation = driver.find_element(By.CLASS_NAME, "suggestor-input")
designation.send_keys('Data Scientist')

In [61]:
search_button = driver.find_element(By.CLASS_NAME, "qsbSubmit")
search_button.click()

In [63]:
location_filter = driver.find_element(By.XPATH, "/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[4]/div[2]/div[3]/label/p/span[1]")
location_filter.click()
time.sleep(5)
salary_filter = driver.find_element(By.XPATH, "/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[5]/div[2]/div[2]/label/p/span[1]")
salary_filter.click()

In [65]:
job_title = []
job_location = []
company_name = []
experience_required = []

In [67]:
title_tags = driver.find_elements(By.XPATH, '//a[@class="title "]')
location_tags = driver.find_elements(By.XPATH, '//span[@class="locWdth"]')
company_tags = driver.find_elements(By.XPATH, '//a[@class=" comp-name mw-25"]')
experience_tags = driver.find_elements(By.XPATH, '//span[@class="expwdth"]')

In [69]:
title_tags = title_tags[:10]
location_tags = location_tags[:10]
company_tags = company_tags[:10]
experience_tags = experience_tags[:10]

In [71]:
for i in title_tags:
    title = i.text
    job_title.append(title)

for i in location_tags:
    location = i.text
    job_location.append(location)

for i in company_tags:
    company = i.text
    company_name.append(company)

for i in experience_tags:
    exp = i.text
    experience_required.append(exp)

In [73]:
print(len(job_title), len(job_location), len(company_name), len(experience_required))

10 10 10 10

In [75]:
import pandas as pd
df = pd.DataFrame({'Title':job_title, 'Location':job_location, 'Company_name':company_name, 'Experience':experience_required})
df

,Title,Location,Company_name,Experience
0,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Nityo Infotech,3-7 Yrs
1,Data Scientist (AI/ML)|| US Based MNC || Noida,Hybrid - Noida,Collegedunia,3-5 Yrs
2,Data Scientist,Gurugram,Growthjockey,0-2 Yrs
3,Data Analyst,New Delhi,Biz Tech Consultants,0-5 Yrs
4,Data Analyst,Gurugram,Biz Tech Consultants,0-1 Yrs
5,,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Biz Tech Consultants,2-6 Yrs
6,,Gurugram,PayU,3-8 Yrs
7,,Ghaziabad,Innovaccer,3-8 Yrs
8,Data Scientist,Noida,IBM,3-8 Yrs
9,Data scientist,"Gurugram, Bengaluru",Times Internet,2-7 Yrs

In [ ]:
# QUESTION - 2

In [ ]:
# amazon laptop question

In [215]:
driver = webdriver.Chrome()

In [217]:
driver.get("http://www.amazon.in/")

In [219]:
designation = driver.find_element(By.ID, "twotabsearchtextbox")
designation.send_keys('Laptop')

In [221]:
search_btn = driver.find_element(By.ID, "nav-search-submit-button")
search_btn.click()

In [223]:
cpu_filter = driver.find_element(By.XPATH, "/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/span/div/div/div[6]/ul[2]/span/span[9]/li/span/a/span")
cpu_filter.click()

In [225]:
laptop_title = [] 
laptop_rating = []
laptop_price = []

In [227]:
title_tags = driver.find_elements(By.XPATH, '//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]') 
rating_tags = driver.find_elements(By.XPATH, '//i[@class="a-icon a-icon-star-small a-star-small-3-5"]') 
price_tags = driver.find_elements(By.XPATH, '//span[@class="a-price-whole"]')

In [229]:
title_tags = title_tags[:10]
rating_tags = price_tags[:10]
price_tags = price_tags[:10]

In [231]:
for i in title_tags:
    title = i.text
    laptop_title.append(title)

for i in rating_tags:
    rating = i.text
    laptop_rating.append(rating)

for i in price_tags:
    price = i.text
    laptop_price.append(price)

In [233]:
print(len(laptop_title), len(laptop_rating), len(laptop_price))

10 10 10

In [235]:
import pandas as pd
df = pd.DataFrame({'Title':laptop_title, 'Rating':laptop_rating, 'Price':laptop_price}) 
df

                                               Title  Rating   Price
0  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...  46,490  46,490
1  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...  47,990  47,990
2  Acer ALG 13th Gen Intel Core i7 Gaming Laptop ...  52,990  52,990
3  Dell [Smartchoice] Inspiron 5430 Thin & Light ...  59,990  59,990
4  (Refurbished) Dell Latitude 7480 14in FHD Lapt...  76,990  76,990
5  Acer Aspire Lite 12th Gen Intel Core i7-1255U ...  71,990  71,990
6  ASUS TUF Gaming F15, 15.6" (39.62cm) FHD 144Hz...  52,990  52,990
7  Dell Inspiron 3530 Laptop, 13th Generation Int...  75,490  75,490
8  Acer Aspire 3 Intel Core i7 12th Gen 1255U - (...  27,531  27,531
9  MSI Thin 15, Intel 13th Gen. Core i7-13620H, 4...  49,990  49,990

In [ ]:
# QUESTION - 3

In [ ]:
# scrape data of top 100 quotes of all time

In [237]:
driver = webdriver.Chrome()

In [239]:
driver.get("http://www.azquotes.com/")

In [241]:
top_quotes = driver.find_element(By.XPATH, "/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a")
top_quotes.click()

In [243]:
quote = [] 
author = []
type_of_quote = []

In [245]:
quote_tags = driver.find_elements(By.XPATH, '//a[@class="title"]') 
author_tags = driver.find_elements(By.XPATH, '//div[@class="author"]') 
type_tags = driver.find_elements(By.XPATH, '//div[@class="tags"]')

In [247]:
for i in quote_tags:
    quot = i.text
    quote.append(quot)

for i in author_tags:
    auth = i.text
    author.append(auth)

for i in type_tags:
    typeofquote = i.text
    type_of_quote.append(typeofquote)

In [249]:
print(len(quote), len(author), len(type_of_quote))

100 100 100

In [251]:
import pandas as pd
df = pd.DataFrame({'Quote':quote, 'Author':author, 'Type of Quote':type_of_quote}) 
df

,Quote,Author,Type of Quote
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
95,"When the going gets weird, the weird turn pro.",Hunter S. Thompson,"Music, Sports, Hunting"
96,When a train goes through a tunnel and it gets...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
97,If you think you are too small to make a diffe...,Dalai Lama,"Inspirational, Funny, Change"
98,"God doesn't require us to succeed, he only req...",Mother Teresa,"Success, God, Mother"
99,Change your thoughts and you change your world.,Norman Vincent Peale,"Inspirational, Motivational, Change"

In [ ]:
# QUESTION - 4

In [ ]:
# 50 most expensive cars in the world

In [471]:
driver = webdriver.Chrome()

In [473]:
driver.get("https://www.motor1.com/")

In [475]:
search_bar = driver.find_element(By.ID, "search_input")
search_bar.send_keys('50 most expensive cars') 
search_button = driver.find_element(By.XPATH, "/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/button[1]")
search_button.click()

In [477]:
article = driver.find_element(By.XPATH, "/html/body/div[9]/div[9]/div/div[1]/div/div/div[1]/div/div[1]/h3")
article.click()

In [479]:
car_name = []
car_price = []

In [481]:
car_tags = driver.find_elements(By.XPATH, '//h3[@class="subheader"]') 
price_tags = driver.find_elements(By.XPATH, '//strong[contains(text(), "$")]')

In [483]:
car_tags = car_tags[:50]
price_tags = price_tags[:50]

In [485]:
for i in car_tags:
    name = i.text
    car_name.append(name)

for i in price_tags:
    price = i.text
    car_price.append(price)

In [487]:
print(len(car_name), len(car_price))

50 50

In [489]:
print(car_name)
print(car_price)

['McLaren Senna GTR', 'Czinger 21C', 'Ferrari Monza', 'Gordon Murray T.33', 'Koenigsegg Gemera', 'Hennessey Venom F5', 'Bentley Bacalar', 'Hispano Suiza Carmen Boulogne', 'Bentley Mulliner Batur', 'SSC Tuatara', 'Lotus Evija', 'Aston Martin Vulcan', 'Delage D12', 'Ferrari Daytona SP3', 'McLaren Speedtail', 'Rimac Nevera', 'Pagani Utopia', 'Pininfarina Battista', 'Gordon Murray T.50', 'Lamborghini Countach', 'Hennessey Venom F5 Revolution', 'Mercedes-AMG Project One', 'Zenvo Aurora', 'Aston Martin Victor', 'Hennessey Venom F5 Roadster', 'Koenigsegg Jesko', 'Aspark Owl', 'Aston Martin Valkyrie', 'W Motors Lykan Hypersport', 'McLaren Solus', 'Pagani Huayra Evo R', 'Lamborghini Sian', 'Koenigsegg CC850', 'Bugatti Chiron Super Sport 300+', 'Gordon Murray Automotive T.50s Niki Lauda', 'Pagani Huayra Roadster BC', 'Lamborghini Veneno', 'Bugatti Bolide', 'Pininfarina B95 Speedster', 'Bugatti Mistral', 'Bugatti Divo', 'Pagani Huayra Imola', 'Pagani Codalunga', 'Mercedes-Maybach Exelero', 'Bugatti Centodieci', 'Bugatti Chiron Profilée', 'Rolls-Royce Sweptail', 'Bugatti La Voiture Noire', 'Rolls-Royce Boat Tail', 'Rolls-Royce La Rose Noire Droptail']
['$1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.8 Million', 'Price: $1.9 Million', 'Price: $1.9 Million', 'Price: $2.0 Million', 'Price: $2.0 Million', 'Price: $2.1 Million', 'Price: $2.3 Million', 'Price: $2.3 Million', 'Price: $2.3 Million', 'Price: $2.3 Million', 'Price: $2.4 Million', 'Price: $2.5 Million', 'Price: $2.5 Million', 'Price: $2.6 Million', 'Price: $2.6 Million', '$2.7 Million', 'Price: $2.7 Million', 'Price: $2.8 Million', 'Price: $3.0 Million', '$3.0 Million', 'Price: $3.0 Million', '$3.1 Million', 'Price: $3.2 Million', 'Price: $3.4 Million', '$3.5 Million', '$3.5 Million (est.)', 'Price: $3.6 million', 'Price: $3.7 Million', 'Price: $3.9 Million', '$3.9 Million', '$4.0 Million', 'Price: $4.5 Million', 'Price: $4.7 Million', 'Price: $4.8 Million', 'Price: $5.0 Million', 'Price: $5.8 Million', '$6.0 Million', 'Price: $7.4 Million', 'Price: $8.0 Million', 'Price: $9.0 Million', 'Price: $10.8 Million', 'Price: $12.8 Million', 'Price: $13.4 Million', 'Price: $28.0 Million (est.)', 'Price: $30 Million (est.)']

In [491]:
import pandas as pd
df = pd.DataFrame({'Name':car_name, 'Price':car_price}) 
df

                                         Name                        Price
0                           McLaren Senna GTR                 $1.7 Million
1                                 Czinger 21C          Price: $1.7 Million
2                               Ferrari Monza          Price: $1.7 Million
3                          Gordon Murray T.33          Price: $1.7 Million
4                           Koenigsegg Gemera          Price: $1.7 Million
5                          Hennessey Venom F5          Price: $1.8 Million
6                             Bentley Bacalar          Price: $1.9 Million
7               Hispano Suiza Carmen Boulogne          Price: $1.9 Million
8                      Bentley Mulliner Batur          Price: $2.0 Million
9                                 SSC Tuatara          Price: $2.0 Million
10                                Lotus Evija          Price: $2.1 Million
11                        Aston Martin Vulcan          Price: $2.3 Million
12                                 Delage D12          Price: $2.3 Million
13                        Ferrari Daytona SP3          Price: $2.3 Million
14                          McLaren Speedtail          Price: $2.3 Million
15                               Rimac Nevera          Price: $2.4 Million
16                              Pagani Utopia          Price: $2.5 Million
17                       Pininfarina Battista          Price: $2.5 Million
18                         Gordon Murray T.50          Price: $2.6 Million
19                       Lamborghini Countach          Price: $2.6 Million
20              Hennessey Venom F5 Revolution                 $2.7 Million
21                   Mercedes-AMG Project One          Price: $2.7 Million
22                               Zenvo Aurora          Price: $2.8 Million
23                        Aston Martin Victor          Price: $3.0 Million
24                Hennessey Venom F5 Roadster                 $3.0 Million
25                           Koenigsegg Jesko          Price: $3.0 Million
26                                 Aspark Owl                 $3.1 Million
27                      Aston Martin Valkyrie          Price: $3.2 Million
28                  W Motors Lykan Hypersport          Price: $3.4 Million
29                              McLaren Solus                 $3.5 Million
30                        Pagani Huayra Evo R          $3.5 Million (est.)
31                           Lamborghini Sian          Price: $3.6 million
32                           Koenigsegg CC850          Price: $3.7 Million
33            Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34  Gordon Murray Automotive T.50s Niki Lauda                 $3.9 Million
35                  Pagani Huayra Roadster BC                 $4.0 Million
36                         Lamborghini Veneno          Price: $4.5 Million
37                             Bugatti Bolide          Price: $4.7 Million
38                  Pininfarina B95 Speedster          Price: $4.8 Million
39                            Bugatti Mistral          Price: $5.0 Million
40                               Bugatti Divo          Price: $5.8 Million
41                        Pagani Huayra Imola                 $6.0 Million
42                           Pagani Codalunga          Price: $7.4 Million
43                   Mercedes-Maybach Exelero          Price: $8.0 Million
44                         Bugatti Centodieci          Price: $9.0 Million
45                    Bugatti Chiron Profilée         Price: $10.8 Million
46                       Rolls-Royce Sweptail         Price: $12.8 Million
47                   Bugatti La Voiture Noire         Price: $13.4 Million
48                      Rolls-Royce Boat Tail  Price: $28.0 Million (est.)
49         Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)

In [ ]:
#QUESTION - 5

In [ ]:
# list of prime ministers of india

In [584]:
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd
import time

# Step 1: Initialize the Chrome driver
driver = webdriver.Chrome()

# Step 2: Open the webpage
driver.get("https://www.jagranjosh.com/general-knowledge/list-ofall-prime-ministers-of-india-1473165149-1")

# Step 3: Wait for the page to load completely
time.sleep(5)

# Step 4: Scrape the table data
names = []
terms_of_office = []
durations = []

# Locate the table rows that contain the data
rows = driver.find_elements(By.XPATH, "//table/tbody/tr")

# Loop through each row and extract the data
for row in rows[1:]:  # Skip the header row
    cols = row.find_elements(By.TAG_NAME, "td")
    
    if len(cols) >= 3:  # Ensure that the row has enough columns
        name = cols[1].text.strip()
        term_of_office = cols[2].text.strip()
        duration = cols[3].text.strip()
        
        names.append(name)
        terms_of_office.append(term_of_office)
        durations.append(duration)

# Step 5: Create a DataFrame with the extracted data
data = {
    'Name': names,
    'Term of Office': terms_of_office,
    'Duration': durations
}

df = pd.DataFrame(data)

# Step 6: Display the DataFrame
print(df)

                       Name      Term of Office          Duration
0          Jawaharlal Nehru  57 years, 274 days     15 August1947
1          Gulzarilal Nanda  65 years, 328 days       27 May 1964
2       Lal Bahadur Shastri  62 years, 250 days       9 June 1964
3          Gulzarilal Nanda  67 years, 191 days   11 January 1966
4             Indira Gandhi   48 years, 66 days   24 January 1966
5             Morarji Desai   81 years, 24 days     24 March 1977
6              Charan Singh  76 years, 217 days      28 July 1979
7             Indira Gandhi   62 years, 56 days   14 January 1980
8              Rajiv Gandhi   40 years, 72 days   31 October 1984
9   Vishwanath Pratap Singh  58 years, 160 days   2 December 1989
10          Chandra Shekhar  63 years, 207 days  10 November 1990
11      P. V. Narasimha Rao  69 years, 358 days      21 June 1991
12     Atal Bihari Vajpayee  71 years, 143 days       16 May 1996
13         H. D. Deve Gowda   63 years, 14 days       1 June 1996
14       Inder Kumar Gujral  77 years, 138 days     21 April 1997
15     Atal Bihari Vajpayee   73 years, 84 days     19 March 1998
16           Manmohan Singh  71 years, 239 days       22 May 2004
17            Narendra Modi  63 years, 251 days       26 May 2014

In [ ]:
# QUESTION - 6

In [ ]:
# shine.com

In [730]:
driver = webdriver.Chrome()

In [732]:
driver.get("https://www.shine.com/")

In [734]:
search_button = driver.find_element(By.CLASS_NAME, "iconH-zoom-white")
search_button.click()

In [736]:
designation_field = driver.find_element(By.ID, "id_q")
designation_field.send_keys('Data Analyst')

In [738]:
location_field = driver.find_element(By.ID, "id_loc")
location_field.send_keys('Bangalore')

In [740]:
experience_field = driver.find_element(By.ID, "id_exp")
experience_field.send_keys('0 Yrs')

In [744]:
search_btn = driver.find_element(By.CLASS_NAME, "searchForm_btnWrap_advance__VYBHN")
search_btn.click()

In [746]:
job_title1 = []
job_location1 = []
company_name1 = []
experience_required1 = []

In [748]:
title_tags1 = driver.find_elements(By.XPATH, '//strong[@class="jobCard_pReplaceH2__xWmHg"]')
location_tags1 = driver.find_elements(By.XPATH, '//div[@class="jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
company_tags1 = driver.find_elements(By.XPATH, '//div[@class="jobCard_jobCard_cName__mYnow"]')
experience_tags1 = driver.find_elements(By.XPATH, '//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')

In [750]:
title_tags1 = title_tags1[:10]
location_tags1 = location_tags1[:10]
company_tags1 = company_tags1[:10]
experience_tags1 = experience_tags1[:10]

In [752]:
for i in title_tags1:
    title = i.text
    job_title1.append(title)

for i in location_tags1:
    location = i.text
    job_location1.append(location)

for i in company_tags1:
    company = i.text
    company_name1.append(company)

for i in experience_tags1:
    exp = i.text
    experience_required1.append(exp)

In [754]:
print(len(job_title1), len(job_location1), len(company_name1), len(experience_required1))

10 10 10 10

In [756]:
import pandas as pd
df = pd.DataFrame({'Title':job_title1, 'Location':job_location1, 'Company_name':company_name1, 'Experience':experience_required1})
df

,Title,Location,Company_name,Experience
0,"Data Analyst , Senior Data Analyst , Data Anal...",Bangalore\n+8,appsoft solutions,0 to 4 Yrs
1,Data Analyst,Bangalore\n+4,aryan technology,0 to 4 Yrs
2,Risk Data Analyst (Senior Quantitative Analyst),Bangalore\n+1,locus enterprises,4 to 9 Yrs
3,Healthcare Data Analyst,Bangalore\n+8,spento papers (india) llp,8 to 13 Yrs
4,Senior Data Analyst,Bangalore\n+8,gallagher and mohan private limited,2 to 7 Yrs
5,Urgent Hiring For Data Analyst,Bangalore\n+2,diraa hr services hiring for diraa ...,0 to 4 Yrs
6,Data Catalog with Data Goverance,Bangalore\n+8,ltimindtree limited,6 to 11 Yrs
7,Data Governance Analyst,Bangalore,white horse manpower consultancy (p...,5 to 8 Yrs
8,Healthcare Analyst,Bangalore\n+7,techno endura,0 to 4 Yrs
9,Business Analyst,Bangalore,spurtree technologies private limit...,5 to 10 Yrs

In [ ]:
# QUESTION - 7

In [ ]:
# iphone reviews

In [768]:
driver = webdriver.Chrome()

In [770]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART")

In [772]:
rating_list = []
review_list = []
full_review_list = []

In [774]:
start = 0
end = 10
for page in range(start,end):
    rating = driver.find_elements(By.XPATH, '//div[@class="XQDdHH Ga3i8K"]')
    for i in rating:
        rating_list.append(i.text)
    review_summary = driver.find_elements(By.XPATH, '//p[@class="z9E0IG"]')
    for i in review_summary:
        review_list.append(i.text)
    full_review = driver.find_elements(By.XPATH, '//div[@class="ZmyHeo"]') 
    for i in full_review:
        full_review_list.append(i.text) 
print(len(rating_list), len(review_list), len(full_review_list))

100 100 100

In [776]:
import pandas as pd
df = pd.DataFrame({'Rating':rating_list, 'Review Summary':review_list, 'Full Review':full_review_list})
df

,Rating,Review Summary,Full Review
0,5,Best in the market!,Good Camera
1,5,Terrific,Very very good
2,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
3,5,Worth every penny,Feeling awesome after getting the delivery of ...
4,5,Perfect product!,Photos super
...,...,...,...
95,5,Terrific purchase,Value for money 😍
96,5,Wonderful,This is amazing at all
97,5,Excellent,NYC
98,5,Brilliant,very good camera quality
99,5,Perfect product!,V Good all

In [ ]:
# QUESTION - 8

In [ ]:
# sneakers scraping

In [790]:
driver = webdriver.Chrome()

In [792]:
driver.get("https://www.flipkart.com/")

In [794]:
search_field = driver.find_element(By.CLASS_NAME, "Pke_EE")
search_field.send_keys('Sneakers')

In [796]:
search_button = driver.find_element(By.CLASS_NAME, "_2iLD__")
search_button.click()

In [798]:
brand_list = []
product_description_list = []
price_list = []

In [808]:
start = 0
end = 3
for page in range(start, end):
    
    brand = driver.find_elements(By.XPATH, '//div[@class="syl9yP"]') 
    for i in brand:
        brand_list.append(i.text)

    product_description = driver.find_elements(By.XPATH, '//a[@class="WKTcLC"]')
    for i in product_description:
        product_description_list.append(i.text)

    price = driver.find_elements(By.XPATH, '//div[@class="Nx9bqj"]')
    for i in price:
        price_list.append(i.text)

brand_list = brand_list[:100]
product_description_list = product_description_list[:100]
price_list = price_list[:100] 
print(len(brand_list), len(product_description_list), len(price_list))

100 100 100

In [810]:
import pandas as pd
df = pd.DataFrame({'Brand':brand_list, 'Product Description':product_description_list, 'Price':price_list})
df

       Brand                                Product Description   Price
0       aadi  Stylish & Trending Outdoor Walking Comfortable...    ₹299
1   URBANBOX                           PUMA UP Sneakers For Men    ₹299
2       PUMA                             OG-D3 Sneakers For Men  ₹1,800
3     CAMPUS  Sneaker Casual Shoes For Men | Soft Cushion In...    ₹502
4       aadi  Sneaker Casual Shoes For Men | Soft Cushion In...    ₹360
..       ...                                                ...     ...
95      PUMA                     Modern Trendy Sneakers For Men  ₹1,200
96    corsac                  Pacer Slip on V3 Sneakers For Men    ₹509
97    BRUTON                        Good Vibes Sneakers For Men    ₹478
98    CAMPUS               Spring Edge Alpha 2 Sneakers For Men    ₹556
99  Red Tape  Casual Sneaker Shoes For Women | Stylish and C...  ₹1,517

[100 rows x 3 columns]